# Data wrangling

*   Manipulacion de dataframes
*   Tablas agregadas
*   Exploracion de datos y visualizaciones

# Preparacion

In [1]:
# importando modulos que se van a utilizar
import os
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt # visualizacion
import seaborn as sns # seaborn

In [3]:
# identificar el directorio y la ruta del archivo a consultar
mainpath = "https://raw.githubusercontent.com/elprincipitogauss/lesson/main/"
filename = "Salary_Dataset_with_Extra_Features.csv"
fullpath = os.path.join(mainpath, filename)
# leer el archivo utilizando la ruta
df_000 = pd.read_csv(fullpath)
# realizar una copia del archivo leido copmo backup
df = df_000.copy()

# Visualizar dataframe

In [4]:
display(df)

,Rating,Company Name,Job Title,Salary,Salaries Reported,Location,Employment Status,Job Roles
0,3.8,Sasken,Android Developer,400000,3,Bangalore,Full Time,Android
1,4.5,Advanced Millennium Technologies,Android Developer,400000,3,Bangalore,Full Time,Android
2,4.0,Unacademy,Android Developer,1000000,3,Bangalore,Full Time,Android
3,3.8,SnapBizz Cloudtech,Android Developer,300000,3,Bangalore,Full Time,Android
4,4.4,Appoids Tech Solutions,Android Developer,600000,3,Bangalore,Full Time,Android
...,...,...,...,...,...,...,...,...
22765,4.7,Expert Solutions,Web Developer,200000,1,Bangalore,Full Time,Web
22766,4.0,Nextgen Innovation Labs,Web Developer,300000,1,Bangalore,Full Time,Web
22767,4.1,Fresher,Full Stack Web Developer,192000,13,Bangalore,Full Time,Web
22768,4.1,Accenture,Full Stack Web Developer,300000,7,Bangalore,Full Time,Web
22769,3.8,Thomson Reuters,Associate Web Developer,300000,7,Bangalore,Full Time,Web

In [5]:
df.head(5)

,Rating,Company Name,Job Title,Salary,Salaries Reported,Location,Employment Status,Job Roles
0,3.8,Sasken,Android Developer,400000,3,Bangalore,Full Time,Android
1,4.5,Advanced Millennium Technologies,Android Developer,400000,3,Bangalore,Full Time,Android
2,4.0,Unacademy,Android Developer,1000000,3,Bangalore,Full Time,Android
3,3.8,SnapBizz Cloudtech,Android Developer,300000,3,Bangalore,Full Time,Android
4,4.4,Appoids Tech Solutions,Android Developer,600000,3,Bangalore,Full Time,Android

* Información sobre las dimensiones y tipo de variables

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22770 entries, 0 to 22769
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Rating             22770 non-null  float64
 1   Company Name       22769 non-null  object
 2   Job Title          22770 non-null  object
 3   Salary             22770 non-null  int64
 4   Salaries Reported  22770 non-null  int64
 5   Location           22770 non-null  object
 6   Employment Status  22770 non-null  object
 7   Job Roles          22770 non-null  object
dtypes: float64(1), int64(2), object(5)
memory usage: 1.4+ MB

## Subconjuntos

* construir un subconjunto de filas a través de su posición

In [7]:
# navegar por datfarame utilizando la localizacion
# entre las llaves a la izquierda encontramos las filas y a la derecha encontraremos las columnas
df.iloc[0:3,] # range 0:3  solo incluye 0,1 y 2

,Rating,Company Name,Job Title,Salary,Salaries Reported,Location,Employment Status,Job Roles
0,3.8,Sasken,Android Developer,400000,3,Bangalore,Full Time,Android
1,4.5,Advanced Millennium Technologies,Android Developer,400000,3,Bangalore,Full Time,Android
2,4.0,Unacademy,Android Developer,1000000,3,Bangalore,Full Time,Android

In [8]:

# entre las llaves a la izquierda encontramos las filas y a la derecha encontraremos las columnas
df.iloc[0:2,1:] # fila 0,1 y las columnas desde la 1

,Company Name,Job Title,Salary,Salaries Reported,Location,Employment Status,Job Roles
0,Sasken,Android Developer,400000,3,Bangalore,Full Time,Android
1,Advanced Millennium Technologies,Android Developer,400000,3,Bangalore,Full Time,Android

In [9]:
df['Salary'] # selecciona una columna

0         400000
1         400000
2        1000000
3         300000
4         600000
          ...
22765     200000
22766     300000
22767     192000
22768     300000
22769     300000
Name: Salary, Length: 22770, dtype: int64

In [10]:
df[['Job Title', 'Salary']] # seleccionamos dos columnas del dataframe indicando con lista de nombre de columnas

                      Job Title   Salary
0             Android Developer   400000
1             Android Developer   400000
2             Android Developer  1000000
3             Android Developer   300000
4             Android Developer   600000
...                         ...      ...
22765             Web Developer   200000
22766             Web Developer   300000
22767  Full Stack Web Developer   192000
22768  Full Stack Web Developer   300000
22769   Associate Web Developer   300000

[22770 rows x 2 columns]

In [11]:
# haga una lista de las columnas segun el tipo de datos que contienen solicitado
df.select_dtypes(['float64' , 'int64']).columns

Index(['Rating', 'Salary', 'Salaries Reported'], dtype='object')

In [12]:
# filtrar la base dada una condicion
df[df['Salary']>300000]

,Rating,Company Name,Job Title,Salary,Salaries Reported,Location,Employment Status,Job Roles
0,3.8,Sasken,Android Developer,400000,3,Bangalore,Full Time,Android
1,4.5,Advanced Millennium Technologies,Android Developer,400000,3,Bangalore,Full Time,Android
2,4.0,Unacademy,Android Developer,1000000,3,Bangalore,Full Time,Android
4,4.4,Appoids Tech Solutions,Android Developer,600000,3,Bangalore,Full Time,Android
7,3.1,Samsung R&D Institute India - Bangalore,Android Developer,400000,3,Bangalore,Full Time,Android
...,...,...,...,...,...,...,...,...
22752,3.7,SwervePoint,Web Developer,600000,1,Bangalore,Full Time,Web
22753,4.3,rtCamp,Web Developer,700000,1,Bangalore,Full Time,Web
22758,4.5,Blu Ocean Innovations,Web Developer - Intern,408000,1,Bangalore,Intern,Web
22763,4.4,Unicon Systems,Web Developer,500000,1,Bangalore,Full Time,Web
22764,5.0,BJSHub,Web Developer,400000,1,Bangalore,Full Time,Web

In [13]:
# filtrar la base dada una condicion
df[df.Salary>500000]

,Rating,Company Name,Job Title,Salary,Salaries Reported,Location,Employment Status,Job Roles
2,4.0,Unacademy,Android Developer,1000000,3,Bangalore,Full Time,Android
4,4.4,Appoids Tech Solutions,Android Developer,600000,3,Bangalore,Full Time,Android
9,3.6,Endeavour Software Technologies,Android Developer,600000,3,Bangalore,Full Time,Android
12,3.7,Wibmo,Android Developer,900000,2,Bangalore,Full Time,Android
14,3.9,Bookmyshow,Android Developer,600000,2,Bangalore,Full Time,Android
...,...,...,...,...,...,...,...,...
22728,3.9,YMedia,Web Developer,800000,1,Bangalore,Full Time,Web
22743,4.0,Nones,Web Developer,576000,1,Bangalore,Full Time,Web
22748,4.2,Full Time Soluções em Serviços Financeiros,Web Developer,1176000,1,Bangalore,Full Time,Web
22752,3.7,SwervePoint,Web Developer,600000,1,Bangalore,Full Time,Web
22753,4.3,rtCamp,Web Developer,700000,1,Bangalore,Full Time,Web

In [14]:
lista_buscar = ['Accenture','Oracle'] # lista de opciones en string
df[df['Company Name'].isin(lista_buscar)]

,Rating,Company Name,Job Title,Salary,Salaries Reported,Location,Employment Status,Job Roles
594,4.1,Accenture,Senior Android Developer,700000,5,Bangalore,Full Time,Android
612,4.1,Accenture,Android Applications Developer,500000,2,Bangalore,Full Time,Android
638,4.1,Accenture,Android Software Developer,400000,1,Bangalore,Full Time,Android
878,4.1,Accenture,Senior Android Applications Developer,700000,1,Bangalore,Full Time,Android
906,4.1,Accenture,Android Team Lead,1700000,1,Bangalore,Full Time,Android
...,...,...,...,...,...,...,...,...
21768,4.1,Accenture,Software Test Analyst,400000,19,Bangalore,Full Time,SDE
21781,4.1,Accenture,Web Developer,400000,8,Bangalore,Full Time,Web
21799,3.9,Oracle,Web Developer,200000,4,Bangalore,Full Time,Web
22607,3.9,Oracle,Web Developer - Intern,588000,1,Bangalore,Intern,Web
22768,4.1,Accenture,Full Stack Web Developer,300000,7,Bangalore,Full Time,Web

In [15]:
# filtrar la base dada una condicion
# que los valores de la columna se encuentre en la lista indicada
lista_a_buscar = [4,5,6,7]

# filtrar dataframe segun condicion de busqyeueda dentro de lista
df[df['Salaries Reported'].isin(lista_a_buscar)]

# df[df["Salaries Reported"].isin([4,5,6,7])]

,Rating,Company Name,Job Title,Salary,Salaries Reported,Location,Employment Status,Job Roles
594,4.1,Accenture,Senior Android Developer,700000,5,Bangalore,Full Time,Android
595,3.8,3Embed Software Technologies,Senior Android Developer,360000,4,Bangalore,Full Time,Android
1139,4.2,Contus,Senior Android Developer,720000,4,Chennai,Full Time,Android
1584,3.8,Mobisoft Labs,Android Developer,312000,4,New Delhi,Full Time,Android
1585,3.6,Tech Mahindra,Android Developer,300000,4,New Delhi,Full Time,Android
...,...,...,...,...,...,...,...,...
21798,3.3,Webhelp,Web Developer,96000,4,Bangalore,Full Time,Web
21799,3.9,Oracle,Web Developer,200000,4,Bangalore,Full Time,Web
21800,3.3,Octact Solutions,Web Developer,120000,4,Bangalore,Full Time,Web
22768,4.1,Accenture,Full Stack Web Developer,300000,7,Bangalore,Full Time,Web
22769,3.8,Thomson Reuters,Associate Web Developer,300000,7,Bangalore,Full Time,Web

In [16]:
# filtrar cuando cumpla dos condiciones al mismo tiempo
# or |
# and &
# not !
df[(df.Salary>1500000) & (df["Salaries Reported"].isin([8,9]))]

,Rating,Company Name,Job Title,Salary,Salaries Reported,Location,Employment Status,Job Roles
12528,4.1,Swiggy,Software Development Engineer I,1800000,8,Bangalore,Full Time,SDE
12684,4.4,ShareChat,Software Development Engineer (SDE),1800000,8,Bangalore,Full Time,SDE
12754,3.5,Trilogy Innovations,Software Development Engineer (SDE),2400000,9,Bangalore,Full Time,SDE
12776,4.5,ZestMoney,Software Development Engineer (SDE) II,1600000,9,Bangalore,Full Time,SDE
12777,3.7,Groupon,Software Development Engineer (SDE) II,2000000,8,Bangalore,Full Time,SDE
12797,3.3,Walmart,Software Development Engineer III,2200000,9,Bangalore,Full Time,SDE
12800,4.0,Zeta Suite,Software Development Engineer (SDE) II,1700000,8,Bangalore,Full Time,SDE
12813,3.3,Ola,Software Development Engineer-II,2300000,8,Bangalore,Full Time,SDE
12928,4.1,Swiggy,Software Development Engineer (SDE) II,2600000,8,Bangalore,Full Time,SDE
12953,4.0,Tesco Bengaluru,Software Development Engineer (SDE) II,2300000,9,Bangalore,Full Time,SDE
17834,3.8,Amazon,Software Development Engineer-II,2200000,8,New Delhi,Full Time,SDE

## Eliminar valores ausentes/omitidos

In [22]:
# drop : eliminar
# na :  valores ausentes NULL, NaN, NA
df.dropna(subset=["Company Name"], axis=0, inplace=True) # eliminar filas con valores en ausentes en la columna indicada

## Limpieza de texto

* lower: Poner en minúscula todo el texto.
* replace: Remplazar ciertos valores por otros.
* strip: Eliminar los espacios al principio y al final de la cadena.
* title: Poner primera letra de cada palabra en mayúscula.

In [23]:
txt = ' canción 9  '
txt.lower()

' canción 9  '

In [24]:
txt = ' canción 9  '
txt.upper()

' CANCIÓN 9  '

In [25]:
txt = ' canción 9  '
txt.replace("c","k")

' kankión 9  '

In [26]:
txt = ' canción 9  '
txt.strip()

'canción 9'

In [27]:
txt = ' canción 9  '
txt.title()

' Canción 9  '

In [28]:
# generar nueva columna luego de realizar un tratamiento de texto
df["Company Name 2nd"] = df["Company Name"].str.upper()
df["Company Name 2nd"] = df["Company Name 2nd"].str.replace("S","XXX")
df["Company Name 2nd"] = df["Company Name 2nd"].str.strip()
df["Company Name 2nd"] = df["Company Name 2nd"].str.title()
df[["Company Name","Company Name 2nd"]]

                           Company Name                    Company Name 2nd
0                                Sasken                          Xxxaxxxken
1      Advanced Millennium Technologies  Advanced Millennium Technologiexxx
2                             Unacademy                           Unacademy
3                    SnapBizz Cloudtech                Xxxnapbizz Cloudtech
4                Appoids Tech Solutions        Appoidxxx Tech Xxxolutionxxx
...                                 ...                                 ...
22765                  Expert Solutions                Expert Xxxolutionxxx
22766           Nextgen Innovation Labs           Nextgen Innovation Labxxx
22767                           Fresher                           Frexxxher
22768                         Accenture                           Accenture
22769                   Thomson Reuters                 Thomxxxon Reuterxxx

[22769 rows x 2 columns]

In [29]:
# generar nueva columna luego de realizar un tratamiento de texto

df["Company Name 2nd"] = (df["Company Name"]
                            .str.upper()# mayusculas
                            .str.replace("S","XXX")
                            .str.strip()
                            .str.title()
                           ) 
df[["Company Name","Company Name 2nd"]]

                           Company Name                    Company Name 2nd
0                                Sasken                          Xxxaxxxken
1      Advanced Millennium Technologies  Advanced Millennium Technologiexxx
2                             Unacademy                           Unacademy
3                    SnapBizz Cloudtech                Xxxnapbizz Cloudtech
4                Appoids Tech Solutions        Appoidxxx Tech Xxxolutionxxx
...                                 ...                                 ...
22765                  Expert Solutions                Expert Xxxolutionxxx
22766           Nextgen Innovation Labs           Nextgen Innovation Labxxx
22767                           Fresher                           Frexxxher
22768                         Accenture                           Accenture
22769                   Thomson Reuters                 Thomxxxon Reuterxxx

[22769 rows x 2 columns]

## Creación de columnas a partir de otras

In [30]:
df["Total income"]= df["Salary"]*df["Salaries Reported"] # columna total ingreso es resultado de multiplicar dos columnas
df[["Total income","Salary","Salaries Reported"]]

       Total income   Salary  Salaries Reported
0           1200000   400000                  3
1           1200000   400000                  3
2           3000000  1000000                  3
3            900000   300000                  3
4           1800000   600000                  3
...             ...      ...                ...
22765        200000   200000                  1
22766        300000   300000                  1
22767       2496000   192000                 13
22768       2100000   300000                  7
22769       2100000   300000                  7

[22769 rows x 3 columns]

## Renombrar columnas

In [31]:
print(df.columns) # muetsreme nombre original de las variables
# renombrar columnas 
df.rename(columns={"Rating":"Rate"},inplace=True) # renombre una de las variables
# inplace=True indica que aplique sobre el objeto sin necesidad de asignar
print(df.columns) # muestreme como quedo despues de renombrar

Index(['Rating', 'Company Name', 'Job Title', 'Salary', 'Salaries Reported',
       'Location', 'Employment Status', 'Job Roles', 'Company Name 2nd',
       'Total income'],
      dtype='object')
Index(['Rate', 'Company Name', 'Job Title', 'Salary', 'Salaries Reported',
       'Location', 'Employment Status', 'Job Roles', 'Company Name 2nd',
       'Total income'],
      dtype='object')

## Modificar tipo de dato de una columna

In [32]:
print(df.info())
print("\n")
df["Rate"]=df["Rate"].astype("str") # modificar el tipo de dato que tiene una columnas
print(df.info())

<class 'pandas.core.frame.DataFrame'>
Index: 22769 entries, 0 to 22769
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Rate               22769 non-null  float64
 1   Company Name       22769 non-null  object
 2   Job Title          22769 non-null  object
 3   Salary             22769 non-null  int64
 4   Salaries Reported  22769 non-null  int64
 5   Location           22769 non-null  object
 6   Employment Status  22769 non-null  object
 7   Job Roles          22769 non-null  object
 8   Company Name 2nd   22769 non-null  object
 9   Total income       22769 non-null  int64
dtypes: float64(1), int64(3), object(6)
memory usage: 1.9+ MB
None


<class 'pandas.core.frame.DataFrame'>
Index: 22769 entries, 0 to 22769
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Rate               22769 non-null  object
 1   Company Name       22769 non-null  object
 2   Job Title          22769 non-null  object
 3   Salary             22769 non-null  int64
 4   Salaries Reported  22769 non-null  int64
 5   Location           22769 non-null  object
 6   Employment Status  22769 non-null  object
 7   Job Roles          22769 non-null  object
 8   Company Name 2nd   22769 non-null  object
 9   Total income       22769 non-null  int64
dtypes: int64(3), object(7)
memory usage: 1.9+ MB
None

In [33]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
Index: 22769 entries, 0 to 22769
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Rate               22769 non-null  object
 1   Company Name       22769 non-null  object
 2   Job Title          22769 non-null  object
 3   Salary             22769 non-null  int64
 4   Salaries Reported  22769 non-null  int64
 5   Location           22769 non-null  object
 6   Employment Status  22769 non-null  object
 7   Job Roles          22769 non-null  object
 8   Company Name 2nd   22769 non-null  object
 9   Total income       22769 non-null  int64
dtypes: int64(3), object(7)
memory usage: 1.9+ MB
None

## Eliminar filas

In [34]:
print("Antes : {0}.".format(df.shape))
# como borrar filas/columnas de un datframe
df = df.drop(df.iloc[0:3,].index) # drop : eliminar/borrar
print("Luego : {0}.".format(df.shape))

Antes : (22769, 10).
Luego : (22766, 10).

In [35]:
# eliminar duplicados
df.drop_duplicates(subset='Job Title' , inplace=False)

,Rate,Company Name,Job Title,Salary,Salaries Reported,Location,Employment Status,Job Roles,Company Name 2nd,Total income
3,3.8,SnapBizz Cloudtech,Android Developer,300000,3,Bangalore,Full Time,Android,Xxxnapbizz Cloudtech,900000
13,4.8,Retail Pulse,Android Developer - Intern,24000,2,Bangalore,Intern,Android,Retail Pulxxxe,48000
115,3.6,Quess,Android Developer - Contractor,700000,1,Bangalore,Contractor,Android,Quexxxxxx,700000
270,3.5,Appface,Android Developer Contractor,168000,1,Bangalore,Contractor,Android,Appface,168000
594,4.1,Accenture,Senior Android Developer,700000,5,Bangalore,Full Time,Android,Accenture,3500000
...,...,...,...,...,...,...,...,...,...,...
21806,4.1,First Student,Web Developer - Intern,60000,3,Bangalore,Intern,Web,Firxxxt Xxxtudent,180000
21965,4.0,Self,Web Developer - Contractor,400000,1,Bangalore,Contractor,Web,Xxxelf,400000
22088,4.0,DoozieSoft,Web Developer Contractor,120000,1,Bangalore,Contractor,Web,Dooziexxxoft,120000
22767,4.1,Fresher,Full Stack Web Developer,192000,13,Bangalore,Full Time,Web,Frexxxher,2496000
22769,3.8,Thomson Reuters,Associate Web Developer,300000,7,Bangalore,Full Time,Web,Thomxxxon Reuterxxx,2100000

# Eliminar columnas

In [36]:
print("Antes : {0}.".format(df.shape))
# eliminar filas/columnas
df = df.drop(columns=['Employment Status'])
print("Luego : {0}.".format(df.shape))

Antes : (22766, 10).
Luego : (22766, 9).

## Ordenar dataframes

In [37]:
df.sort_values(["Salary"], ascending=False)

,Rate,Company Name,Job Title,Salary,Salaries Reported,Location,Job Roles,Company Name 2nd,Total income
18635,3.6,Thapar University,Software Development Engineer (SDE),90000000,1,New Delhi,SDE,Thapar Univerxxxity,90000000
9260,3.6,OASYS Cybernetics,Senior Java Developer,10000000,1,Chennai,Java,Oaxxxyxxx Cyberneticxxx,10000000
7121,3.5,Koru UX Design,Senior Front End Developer,10000000,1,Pune,Frontend,Koru Ux Dexxxign,10000000
4471,3.8,Concentrix,Oracle Database Administrator,10000000,1,Bangalore,Database,Concentrix,10000000
5819,3.7,Nityo Infotech,"Lead UI Designer, Magento Front-end Developer",9900000,1,Bangalore,Frontend,Nityo Infotech,9900000
...,...,...,...,...,...,...,...,...,...
22028,3.9,Yes Bank,Web Developer,12000,1,Bangalore,Web,Yexxx Bank,12000
18429,4.0,....,Software Development Engineer (SDE),12000,1,New Delhi,SDE,....,12000
7514,3.9,Al-Jazirah,Senior IOS Developer,12000,1,Bangalore,IOS,Al-Jazirah,12000
9937,3.7,Virtusa,Junior Java Developer,8448,5,Hyderabad,Java,Virtuxxxa,42240
22563,2.6,Keeves Technologies,Web Developer - Intern,2112,1,Bangalore,Web,Keevexxx Technologiexxx,2112

In [38]:
df.sort_values(["Salary"], ascending=True)

,Rate,Company Name,Job Title,Salary,Salaries Reported,Location,Job Roles,Company Name 2nd,Total income
22563,2.6,Keeves Technologies,Web Developer - Intern,2112,1,Bangalore,Web,Keevexxx Technologiexxx,2112
9937,3.7,Virtusa,Junior Java Developer,8448,5,Hyderabad,Java,Virtuxxxa,42240
10316,3.9,Awign Enterprises,Senior Java Developer Contractor,12000,1,Hyderabad,Java,Awign Enterprixxxexxx,12000
2472,3.5,Acmatics Technologies,Android Developer,12000,1,New Delhi,Android,Acmaticxxx Technologiexxx,12000
22028,3.9,Yes Bank,Web Developer,12000,1,Bangalore,Web,Yexxx Bank,12000
...,...,...,...,...,...,...,...,...,...
5819,3.7,Nityo Infotech,"Lead UI Designer, Magento Front-end Developer",9900000,1,Bangalore,Frontend,Nityo Infotech,9900000
4471,3.8,Concentrix,Oracle Database Administrator,10000000,1,Bangalore,Database,Concentrix,10000000
9260,3.6,OASYS Cybernetics,Senior Java Developer,10000000,1,Chennai,Java,Oaxxxyxxx Cyberneticxxx,10000000
7121,3.5,Koru UX Design,Senior Front End Developer,10000000,1,Pune,Frontend,Koru Ux Dexxxign,10000000
18635,3.6,Thapar University,Software Development Engineer (SDE),90000000,1,New Delhi,SDE,Thapar Univerxxxity,90000000

## tablas agregadas

In [ ]:
# creamos un dataframe
df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo","bar", "bar", "bar", "bar"],
                   "B": ["one", "one", "one", "two", "two","one", "one", "two", "two"],
                   "C": ["small", "large", "large", "small", "small", "large", "small", "small","large"],
                   "D": [1, 2, 2, 3, 3, 4, 5, 6, 7],
                   "E": [2, 4, 5, 5, 6, 6, 8, 9, 9]})
# mostramos df
df

In [ ]:
# utilizar la funcion groupby para agregar datos (pivot table/tablas dinamicas)
# agrupe por la columna C y haga la suma de todos los valores de la columna D y luego lo mismo para la E
# estoy sumando los valores D que son small 1+3+3+5+6 = 18
df.groupby('C')[['D', 'E']].sum() # agrupar por unas keys/columnas

In [ ]:
# utilizar funcion pivot_table para agregar datos
pd.pivot_table(
    df, # dataframe
    values='D', # de donde toma los valores
    index=['A', 'B'], # filas
     columns=['C'], # columnas 
     aggfunc=np.sum # y funcion a aplicar de numpy
     )

In [ ]:
pd.pivot_table(
    df, 
    values=['D', 'E'], 
    index=['A', 'C'],
    aggfunc={
        'D': np.mean, # promedios
        'E': [min, max, np.mean] # promedio, max y minimo
        }
        )

## Exploración de datos

In [ ]:
df = df_000.copy() # backup

In [ ]:
df.describe()

In [ ]:
# tablas contigencia
pd.crosstab(df.Location,df['Employment Status'])

In [ ]:
# calculo de estadisticos por cada variable a seleccionar
p0=df.Salary.min() 
p100=df.Salary.max()
q1=df.Salary.quantile(0.25)
q2=df.Salary.quantile(0.5)
q3=df.Salary.quantile(0.75)
InterQuartilRange = q3-q1
print(p0,p100,q1,q2,q3,InterQuartilRange)

In [ ]:
df.Salary.hist()
plt.show()

In [ ]:
plt.boxplot(df['Salary'])
plt.show()

In [ ]:
# agrupar por la variable seleccionada y aplicar la funcion de interes(suma)
dataframe_plot = df.groupby('Employment Status').Salary.sum() # construyo datos
dataframe_plot.plot(kind = 'pie') # construyo grafica
plt.show() # muestro graficop

# df.groupby('Employment Status').Salary.sum().plot(kind='pie')
# plt.show()

In [ ]:
# diagramas de dispersion
df.plot(x='Salaries Reported',y='Salary',kind = 'scatter')
plt.show()

In [ ]:
# construir una matriz de correlacion
# esto solo aplica a variables numericas

# 1ro seleccionar variables numericas
dataframe_prueba = df.select_dtypes(['float64','int64'])
# 2do construir matriz correlacion (pearson) con las variables numericas
dataframe_prueba.corr()

In [ ]:
# con seaborn construi matriz de correlacion visualmente mejorada
sns.heatmap(df.select_dtypes(['float64' , 'int64']).corr(),annot=True)
plt.show()

In [ ]:
# diagramas de barras
df.groupby('Location').Salary.sum().plot(kind='bar') # haga un diagrama de barras con el resultado de agrupas y sumar
plt.show()

In [ ]:
# barh para indicar que es horizontal
df.groupby('Location').Salary.sum().plot(kind='barh') # barh indica barras horizontales
plt.show()

In [ ]:
summary=df.groupby('Location').Salary.sum()
plt.bar(x=summary.index , height=summary.values)
plt.rcParams["figure.figsize"] = (20,15)
plt.show()

In [ ]:
summary=df.groupby('Location').Salary.sum()
sns.barplot(x=summary.index , y=summary.values)
plt.rcParams["figure.figsize"] = (10,6)
plt.show()

In [ ]:
df.columns

In [ ]:
# una linea de puntas
df.groupby('Salaries Reported').Salary.sum().plot(kind='line') # hace un grafico linea
plt.rcParams["figure.figsize"] = (10,6)
plt.show()

In [ ]:
df.groupby('Location').Salary.sum().plot(kind='pie')
plt.rcParams["figure.figsize"] = (15,6)
plt.show()

In [ ]:
pd.crosstab(df.Location,df['Employment Status'])

In [ ]:
# construi un heatmap una diagram de calor
# preparar datos antes de visualizacion
tab_00 = pd.crosstab(df.Location,df['Employment Status'])
# usar datros preparados para plotear graficar
sns.heatmap(tab_00)
plt.show()

## Bibliografía


* (2022,Montenegro y Montenegro) Aprendizaje profundo. Diplomado de IA y AP. 
* BeginnersGuide. link :https://wiki.python.org/moin/BeginnersGuide/Programmers
* Uniwebsidad. link :https://uniwebsidad.com/libros/algoritmos-python